cfg/Catalogs/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидГрафика</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРабочихГрафиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммированныйУчетРабочегоВремени</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйВыходной</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойВыходной</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтсчета</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьРабочейНедели</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеРабочееВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикПолногоРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДневныхЧасов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоВечернихЧасов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоНочныхЧасов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращеннаяРабочаяНеделя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеполныйРабочийДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходныеПоСкользящемуГрафику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПраздники</Name>
					<Comment>Учитывать праздники при автозаполнении графика</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВечерниеЧасы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНочныеЧасы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ШаблонЗаполненияГрафикаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращатьКалендарныеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Смены</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерДня</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Смены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПериодыСмены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/InformationRegisters/ГрафикиРаботыПоВидамВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыПоВидамВремени</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДни</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьПятидневка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьШестидневка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначениеНорма</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначениеНорма</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначениеПолное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначениеПолное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначениеНормаПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначениеНормаПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДниПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьПятидневкаЧасы</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьПятидневкаПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьПятидневкаЧасыПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьШестидневкаПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДниСПраздниками</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВводИндивидуальныхГрафиковРаботыОрганизации</v8:Type>
						<v8:Type>cfg:DocumentRef.СдельныйНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ВидыРабочихГрафиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыРабочихГрафиков</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пятидневка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шестидневка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сменный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КалендарныеДни</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Catalogs/ГрафикиРаботы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем ДанныеКалендаряИзменены;
Перем ПоказыватьНочныеКолонки;
Перем ПоказыватьВечерниеКолонки;

// Список соответствий 1 - пн, 2 - вт,.... 7 - вс.
Перем ДниНедели;

Перем БледноКрасныйЦвет;

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура обновляет строку, содержащую описание текущего графика
//
Процедура ОбновитьИнформационнуюСтроку()
	ИнфСтрока = "";
	Если ВидГрафика = Перечисления.ВидыРабочихГрафиков.КалендарныеДни Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='График по календарным дням. ';uk='Графік по календарним дням. '");
	ИначеЕсли ВидГрафика = Перечисления.ВидыРабочихГрафиков.Пятидневка 
		И ПериодыСмены.Количество() = 5
		И ПериодыСмены[0].ДеньНедели = Перечисления.ДниНедели.Понедельник И ПериодыСмены[0].ВремяНачала = Дата(1,1,1,8,0,0) И ПериодыСмены[0].ВремяОкончания = Дата(1,1,1,16,0,0)
		И ПериодыСмены[1].ДеньНедели = Перечисления.ДниНедели.Вторник И ПериодыСмены[1].ВремяНачала = Дата(1,1,1,8,0,0) И ПериодыСмены[1].ВремяОкончания = Дата(1,1,1,16,0,0)
		И ПериодыСмены[2].ДеньНедели = Перечисления.ДниНедели.Среда И ПериодыСмены[2].ВремяНачала = Дата(1,1,1,8,0,0) И ПериодыСмены[2].ВремяОкончания = Дата(1,1,1,16,0,0)
		И ПериодыСмены[3].ДеньНедели = Перечисления.ДниНедели.Четверг И ПериодыСмены[3].ВремяНачала = Дата(1,1,1,8,0,0) И ПериодыСмены[3].ВремяОкончания = Дата(1,1,1,16,0,0)
		И ПериодыСмены[4].ДеньНедели = Перечисления.ДниНедели.Пятница И ПериодыСмены[4].ВремяНачала = Дата(1,1,1,8,0,0) И ПериодыСмены[4].ВремяОкончания = Дата(1,1,1,16,0,0) Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='График пятидневка, 40-часовая рабочая неделя, выходные суббота и воскресенье. ';uk=""Графік п'ятиденка, 40-годинний робочий тиждень, вихідні субота і неділя. """);
	ИначеЕсли ВидГрафика = Перечисления.ВидыРабочихГрафиков.Пятидневка Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='Вид графика - Пятидневка. ';uk=""Вид графіка - П'ятиденка. """);
	ИначеЕсли ВидГрафика = Перечисления.ВидыРабочихГрафиков.Шестидневка Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='Вид графика - Шестидневка. ';uk='Вид графіка - Шестиденка. '");		
	ИначеЕсли Смены.Количество() = 3 
		И Смены[0].Смена = Справочники.Смены.Смена24Часа
		И Смены[1].Смена = Справочники.Смены.ПустаяСсылка()
		И Смены[2].Смена = Справочники.Смены.ПустаяСсылка() Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='График сутки через двое. ';uk='Графік доба через двоє. '");	
		ИнфСтрока = ИнфСтрока + НСтр("ru='Дата отсчета - ';uk='Дата відліку - '") + Формат(ДатаОтсчета, "ДЛФ=Д") + ". ";
	ИначеЕсли Смены.Количество() = 4 
		И Смены[0].Смена = Справочники.Смены.Смена24Часа
		И Смены[1].Смена = Справочники.Смены.ПустаяСсылка()
		И Смены[2].Смена = Справочники.Смены.ПустаяСсылка()
		И Смены[3].Смена = Справочники.Смены.ПустаяСсылка() Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='График сутки через трое. ';uk='Графік доба через троє. '");	
		ИнфСтрока = ИнфСтрока + НСтр("ru='Дата отсчета - ';uk='Дата відліку - '") + Формат(ДатаОтсчета, "ДЛФ=Д") + ". ";
	ИначеЕсли ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='Вид графика - Сменный. ';uk='Вид графіка - Змінний. '");
		ИнфСтрока = ИнфСтрока + НСтр("ru='Дата отсчета - ';uk='Дата відліку - '") + Формат(ДатаОтсчета, "ДЛФ=Д") + ". ";
	Иначе	
		ИнфСтрока = ИнфСтрока + НСтр("ru='Вид графика - не заполнен. ';uk='Вид графіка - не заповнений. '");
	КонецЕсли;

	Если СуммированныйУчетРабочегоВремени Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='Суммированный учет рабочего времени. ';uk='Підсумований облік робочого часу. '");		
	КонецЕсли;
	Если СокращенноеРабочееВремя Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='Сокращенное рабочее время. ';uk='Скорочений робочий час. '");		
	КонецЕсли;
	Если СокращеннаяРабочаяНеделя Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='Неполная рабочая неделя. ';uk='Неповний робочий тиждень. '");		
	КонецЕсли;
	Если НеполныйРабочийДень Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='Неполный рабочий день. ';uk='Неповний робочий день. '");		
	КонецЕсли;
	Если НЕ ГрафикПолногоРабочегоВремени.Пустая() Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='График полного рабочего времени: ';uk='Графік повного робочого часу: '") + ГрафикПолногоРабочегоВремени + ". ";		
	КонецЕсли;
	Если НачалоДневныхЧасов <> Дата(1,1,1, 0,0,0)
		И (УчитыватьНочныеЧасы ИЛИ УчитыватьВечерниеЧасы) Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='Начало дневных часов: ';uk='Початок денних годин: '") + Формат(НачалоДневныхЧасов, "ДФ=Ч:мм") + ". ";		
	КонецЕсли;
	Если НачалоВечернихЧасов <> Дата(1,1,1, 0,0,0)
		И УчитыватьВечерниеЧасы Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='Начало вечерних часов: ';uk='Початок вечірніх годин: '") + Формат(НачалоВечернихЧасов, "ДФ=Ч:мм") + ". ";		
	КонецЕсли;
	Если НачалоНочныхЧасов <> Дата(1,1,1, 0,0,0)
		И УчитыватьНочныеЧасы Тогда
		ИнфСтрока = ИнфСтрока + НСтр("ru='Начало ночных часов: ';uk='Початок нічних годин: '") + Формат(НачалоНочныхЧасов, "ДФ=Ч:мм") + ". ";		
	КонецЕсли;
	
	ЭлементыФормы.ПараметрыГрафика.Заголовок = ИнфСтрока;
КонецПроцедуры // ОбновитьИнформационнуюСтроку()

// Процедура устанавливает видимость ячеек с вечерними и ночными часами
//
Процедура ОбновитьВидимостьНочныхИВечернихКолонок()
	
	Для ИндексКолонки = 1 По 31 Цикл
		ЭлементыФормы.ТабличноеПолеГрафика.Колонки["ВЧ"+ИндексКолонки].Видимость = ПоказыватьВечерниеКолонки;
		ЭлементыФормы.ТабличноеПолеГрафика.Колонки["НЧ"+ИндексКолонки].Видимость = ПоказыватьНочныеКолонки;
	КонецЦикла;
	
	ЭлементыФормы.ТабличноеПолеГрафика.Колонки.ВечернихЧасовЗаМесяц.Видимость = ПоказыватьВечерниеКолонки;
	ЭлементыФормы.ТабличноеПолеГрафика.Колонки.НочныхЧасовЗаМесяц.Видимость = ПоказыватьНочныеКолонки;
	
	ЭлементыФормы.ТабличноеПолеГрафика.Колонки.ЧасовЗаДень.Видимость = ПоказыватьВечерниеКолонки ИЛИ ПоказыватьНочныеКолонки;
	ЭлементыФормы.ТабличноеПолеГрафика.Колонки.ИзНихВечерних.Видимость = ПоказыватьВечерниеКолонки;
	ЭлементыФормы.ТабличноеПолеГрафика.Колонки.ИзНихНочных.Видимость = ПоказыватьНочныеКолонки;
	
	
	//Для НомерМесяца = 1 По 12 Цикл
	//	ДеньКонцаМесяца = День(КонецМесяца(Дата(Год(ТекущийГод), НомерМесяца, 1)));
	//	Для НомерНесуществующегоДня = ДеньКонцаМесяца+1 По 31 Цикл
	//		ЭлементыФормы.ТабличноеПолеГрафика[НомерМесяца-1]["День"+НомерНесущестующегоДня].
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла;
КонецПроцедуры // ОбновитьВидимостьНочныхИВечернихКолонок()

// Процедура очищает записи таблицы графика
//
Процедура КалендарьНаборЗаписейОчистить()
	Для Каждого СтрокаТаблицы Из КалендарьНаборЗаписей Цикл
		Для НомерДня = 1 По 31 Цикл
			СтрокаТаблицы["День" + НомерДня] = 0;
			СтрокаТаблицы["ВЧ" + НомерДня] = 0;
			СтрокаТаблицы["НЧ" + НомерДня] = 0;
		КонецЦикла;
		СтрокаТаблицы.ЧасовЗаМесяц = 0;
		СтрокаТаблицы.ВечернихЧасовЗаМесяц = 0;
		СтрокаТаблицы.НочныхЧасовЗаМесяц = 0;
		СтрокаТаблицы.ДнейЗаМесяц = 0;
	КонецЦикла;
КонецПроцедуры // КалендарьНаборЗаписейОчистить()

// Процедура отображает содержимое таблицы для записи в таблице значениий за месяц
Функция ОтразитьГодВНабореЗаписей(ДатаГода, ПрочитатьИзНабораЗаписей = Ложь)
	
	
	
	КалендарьНаборЗаписейОчистить();
	ДатаНачалаГода = НачалоГода(ДатаГода);
	ДатаКонцаГода = КонецГода(ДатаГода);
	Если ПрочитатьИзНабораЗаписей тогда
		// если не нашли в таблице, тогда прочитаем из регистра сведений
		ЗаполнитьТаблицуЗаИнтервал(ДатаНачалаГода, ДатаКонцаГода);
	КонецЕсли;
	
	ПоказыватьНочныеКолонки = УчитыватьНочныеЧасы;
	ПоказыватьВечерниеКолонки = УчитыватьВечерниеЧасы;
	КоличествоНаденныхДат = 0;
	
	Для Каждого СтрокаТаблицыДляЗаписи Из ТаблицаДляЗаписи Цикл
		Если СтрокаТаблицыДляЗаписи.Дата >= ДатаНачалаГода
			И СтрокаТаблицыДляЗаписи.Дата <= ДатаКонцаГода Тогда
			
			ТекущийМесяц = Месяц(СтрокаТаблицыДляЗаписи.Дата);
			ТекущийДень  = День(СтрокаТаблицыДляЗаписи.Дата);
			
			КалендарьНаборЗаписей[ТекущийМесяц-1]["День" + ТекущийДень] = СтрокаТаблицыДляЗаписи.Часы;
			КалендарьНаборЗаписей[ТекущийМесяц-1].ЧасовЗаМесяц = КалендарьНаборЗаписей[ТекущийМесяц-1].ЧасовЗаМесяц + СтрокаТаблицыДляЗаписи.Часы;
			Если СтрокаТаблицыДляЗаписи.Часы > 0 Тогда
				КалендарьНаборЗаписей[ТекущийМесяц-1].ДнейЗаМесяц = КалендарьНаборЗаписей[ТекущийМесяц-1].ДнейЗаМесяц + 1;
			КонецЕсли;
			
			КалендарьНаборЗаписей[ТекущийМесяц-1]["ВЧ" + ТекущийДень] = СтрокаТаблицыДляЗаписи.ВечерниеЧасы;
			КалендарьНаборЗаписей[ТекущийМесяц-1].ВечернихЧасовЗаМесяц = КалендарьНаборЗаписей[ТекущийМесяц-1].ВечернихЧасовЗаМесяц + СтрокаТаблицыДляЗаписи.ВечерниеЧасы;
			
			КалендарьНаборЗаписей[ТекущийМесяц-1]["НЧ" + ТекущийДень] = СтрокаТаблицыДляЗаписи.НочныеЧасы;
			КалендарьНаборЗаписей[ТекущийМесяц-1].НочныхЧасовЗаМесяц = КалендарьНаборЗаписей[ТекущийМесяц-1].НочныхЧасовЗаМесяц + СтрокаТаблицыДляЗаписи.НочныеЧасы;
			
			ПоказыватьВечерниеКолонки = ПоказыватьВечерниеКолонки ИЛИ СтрокаТаблицыДляЗаписи.ВечерниеЧасы > 0;
			ПоказыватьНочныеКолонки = ПоказыватьНочныеКолонки ИЛИ СтрокаТаблицыДляЗаписи.НочныеЧасы > 0;
			КоличествоНаденныхДат = КоличествоНаденныхДат + 1;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьВидимостьНочныхИВечернихКолонок();
	
	Возврат КоличествоНаденныхДат;
КонецФункции


// Процедура управляет доступностью реквизитов формы 
Процедура УстановитьДоступностьРеквизитов()
	
	ЭлементыФормы.ТабличноеПолеГрафика.ТолькоПросмотр = (ВидГрафика = Перечисления.ВидыРабочихГрафиков.КалендарныеДни);
	Если ЭтаФорма.ЭтоНовый() Тогда
		ЭлементыФормы.СсылкаИзменитьПараметрыЗаполнения.Видимость = Ложь;
	Иначе
		ЭлементыФормы.СсылкаИзменитьПараметрыЗаполнения.Видимость = Истина;
	КонецЕсли;
	
	
КонецПроцедуры //УстановитьДоступностьРеквизитов

//Функция проверяет, заполнен ли график на указанный в форме год
Функция ПроверитьЗаполненностьГрафика(ТекущийГод)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГрафикРаботы", Ссылка);
	Запрос.УстановитьПараметр("НачалоГода",НачалоГода(ТекущийГод));
	Запрос.УстановитьПараметр("КонецГода",КонецГода(ТекущийГод));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ОсновноеЗначение
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
	|	И ГрафикиРаботыПоВидамВремени.Месяц МЕЖДУ &НачалоГода И &КонецГода
	|	И ГрафикиРаботыПоВидамВремени.ОсновноеЗначение > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.ОсновноеЗначение > 0 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура формирует таблицу для вывода графика
//
Процедура СформироватьТаблицуГрафика()
	
			
	//Заполнение месяцев
	
	Для НомерМесяца = 1 По 12 Цикл
		
		НомерГода = Год(ТекущаяДата());
		ДатаМесяца = Дата(НомерГода, НомерМесяца, 1);
		ДнейВМесяце = День(КонецМесяца(ДатаМесяца));
		
		НоваяСтрока = КалендарьНаборЗаписей.Добавить();
		НазваниеМесяца = Формат(ДатаМесяца, "ДФ=""ММММ""");
		НоваяСтрока.Установить(0, НазваниеМесяца);
		НоваяСтрока.НомерМесяца = НомерМесяца;
		
		
	КонецЦикла;
	
КонецПроцедуры

//Процедура заполняет график по заданным параметрам
//
Процедура ЗаполнитьГрафик(ТекущийГод)
	
	НомерТекущегоГодаПриИзменении(ЭлементыФормы.НомерТекущегоГода);
	Отказ = Ложь;
	Если ПроверитьЗаполненностьГрафика(ТекущийГод)Тогда
		
		Вопрос = НСтр("ru='График на ';uk='Графік на '") + Формат(ЭлементыФормы.НомерТекущегоГода.Значение, "ЧГ=5") + НСтр("ru=' год уже заполнен. Вы хотите перезаполнить график?';uk=' рік вже заповнений. Ви хочете перезаповнити графік?'");
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ Тогда	
		ЗаписатьВФорме();
		ПоместитьТаблицуВТаблицуДляЗаписи(КалендарьНаборЗаписей, ТаблицаДляЗаписи, НачалоГода(ТекущийГод), КонецГода(ТекущийГод));
		ДатаНачалаИнтервала    	= НачалоГода(ТекущийГод);
		ДатаОкончанияИнтервала  = КонецГода(ТекущийГод);
		АвтозаполнениеКалендаря(ДатаНачалаИнтервала, ДатаОкончанияИнтервала);
		ДатаМесяца = ДатаНачалаИнтервала;
		Пока ДатаМесяца <= ДатаОкончанияИнтервала Цикл
			СоответствиеИнтервалыРедактирования.Вставить(ДатаМесяца, Истина);
			ДатаМесяца = ДобавитьМесяц(ДатаМесяца, 1);
		КонецЦикла;
		ОтразитьГодВНабореЗаписей(ДатаНачалаИнтервала);
		
		УстановитьДоступностьРеквизитов();
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ЗаполнитьГрафикНажатие(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ДатаОтсчета) 
		Тогда ДатаОтсчета = ТекущийГод;
	КонецЕсли;
	Если ЭтаФорма.ЭтоНовый() Тогда
		ФормаЗаполнить = ПолучитьФорму("ФормаЗаполнить", ЭтаФорма);
		ЗначениеВозврата = ФормаЗаполнить.ОткрытьМодально();
		Если ЗначениеВозврата = "Заполнить" Тогда
			ЗаполнитьГрафик(ТекущийГод);
		КонецЕсли;
	Иначе
		ЗаполнитьГрафик(ТекущийГод);
	КонецЕсли;
	ОбновитьИнформационнуюСтроку();
	
КонецПроцедуры

Процедура ПриОткрытии()

	ЭлементыФормы.ТабличноеПолеГрафика.Колонки.ЧасовЗаДень.Видимость = Ложь;
	СформироватьТаблицуГрафика();
	
	ТекущийГод = НачалоГода(РабочаяДата);
	НомерТекущегоГода = Год(ТекущийГод);
	ОтразитьГодВНабореЗаписей(ТекущийГод, Истина);
	
	ДанныеКалендаряИзменены = Ложь;
	ОбновитьИнформационнуюСтроку();
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ЗНАЧЕНИЙ РЕКВИЗИТОВ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО  ПОЛЯ КАЛЕНДАРЯ

Процедура ТабличноеПолеГрафикаПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ТекущийМесяц = НачалоМесяца(Дата(НомерТекущегоГода, ОформлениеСтроки.ДанныеСтроки.НомерМесяца, 1));
	Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоМесяца",НачалоМесяца(ТекущийМесяц));
		Запрос.УстановитьПараметр("КонецМесяца",КонецМесяца(ТекущийМесяц));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегламентированныйПроизводственныйКалендарь.ВидДня,
		|	ДЕНЬНЕДЕЛИ(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК ДеньНедели
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|ГДЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоМесяца И &КонецМесяца
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря";
		
		Результат = Запрос.Выполнить();
		//Если Результат.Пустой() Тогда
		//	ДеньНеделиМесяца = ДеньНедели(НачалоМесяца(ТекущийМесяц));
		//	Для ДеньМесяца = 1 по День(КонецМесяца(ТекущийМесяц)) Цикл
		//		
		//		Колонка = ЭлементыФормы.ТабличноеПолеГрафика.Колонки["День"+Строка(ДеньМесяца)];
		//		
		//		Если ДеньНеделиМесяца = 6 Или ДеньНеделиМесяца = 7 Тогда
		//			Колонка.ЦветТекстаШапки = БледноКрасныйЦвет;
		//			Колонка.ШрифтШапки = ШрифтыСтиля.ШрифтВажнойНадписи;
		//		Иначе
		//			Колонка.ЦветТекстаШапки = Новый Цвет();	
		//			Колонка.ШрифтШапки = Новый Шрифт();
		//		КонецЕсли;
		//		
		//		ДеньНеделиМесяца = (ДеньНеделиМесяца%7)+1;
		//	КонецЦикла;
		//Иначе
			Данные = Результат.Выгрузить();
			
			//Для ДеньМесяца = 1 по День(КонецМесяца(ТекущийМесяц)) Цикл
			//	
			//	Колонка = ЭлементыФормы.ТабличноеПолеГрафика.Колонки["День"+Строка(ДеньМесяца)];
			//	
			//	ВидДня = Данные[ДеньМесяца - 1].ВидДня;
			//	Если ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье 
			//		Или ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота Тогда
			//		Колонка.ЦветТекстаШапки = БледноКрасныйЦвет;
			//		Колонка.ШрифтШапки = ШрифтыСтиля.ШрифтВажнойНадписи;
			//	Иначе
			//		Колонка.ЦветТекстаШапки = Новый Цвет();	
			//		Колонка.ШрифтШапки = Новый Шрифт();
			//	КонецЕсли;
			//КонецЦикла;
		//КонецЕсли;
	

	//ОформлениеСтроки.Ячейки.ИзНихВечерних.Видимость = Ложь;
	//ОформлениеСтроки.Ячейки.ИзНихНочных.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.Итого.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.Месяц.ВысотаЯчейки = 2;
	
	ИтогоДней 	  = 0;
	ИтогоЧасов    = 0;
	ИтогоВечерних = 0;
	ИтогоНочных   = 0;
	
	КоличествоДнейВМесяце = День(КонецМесяца(Дата(НомерТекущегоГода, ОформлениеСтроки.ДанныеСтроки.НомерМесяца, 1)));
	ДеньНеделиМесяца = ДеньНедели(НачалоМесяца(ТекущийМесяц));
	Для НомерДня = 1 По 31 Цикл
		
		ЗначениеЯчейки = ДанныеСтроки["День"+НомерДня];
		Если ЗначениеЯчейки <> 0 Тогда
			ОформлениеСтроки.Ячейки["День"+НомерДня].Текст = Строка(ЗначениеЯчейки);
			ИтогоДней = ИтогоДней + 1;
			ИтогоЧасов = ИтогоЧасов + ЗначениеЯчейки;
		КонецЕсли;
		
		ЗначениеЯчейки = ДанныеСтроки["ВЧ"+НомерДня];
		Если ЗначениеЯчейки <> 0 Тогда
			ОформлениеСтроки.Ячейки["ВЧ"+НомерДня].Текст = Строка(ЗначениеЯчейки);
			ИтогоВечерних = ИтогоВечерних + ЗначениеЯчейки;
		КонецЕсли;
		
		ЗначениеЯчейки = ДанныеСтроки["НЧ"+НомерДня];
		Если ЗначениеЯчейки <> 0 Тогда
			ОформлениеСтроки.Ячейки["НЧ"+НомерДня].Текст = Строка(ЗначениеЯчейки);
			ИтогоНочных = ИтогоНочных + ЗначениеЯчейки;
		КонецЕсли;
		
		
		Если НомерДня > КоличествоДнейВМесяце Тогда
			ОформлениеСтроки.Ячейки["День"+НомерДня].ТолькоПросмотр = Истина;
			ОформлениеСтроки.Ячейки["День"+НомерДня].ЦветФона = ЦветаСтиля.ФонНедоступнойСтрокиДокумента;
			
			ОформлениеСтроки.Ячейки["ВЧ"+НомерДня].ТолькоПросмотр = Истина;
			ОформлениеСтроки.Ячейки["ВЧ"+НомерДня].ЦветФона = ЦветаСтиля.ФонНедоступнойСтрокиДокумента;
			
			ОформлениеСтроки.Ячейки["НЧ"+НомерДня].ТолькоПросмотр = Истина;
			ОформлениеСтроки.Ячейки["НЧ"+НомерДня].ЦветФона = ЦветаСтиля.ФонНедоступнойСтрокиДокумента;
		Иначе
			Если Данные.Количество() > 0 Тогда
				  ВидДня = Данные[НомерДня - 1].ВидДня;
				Если ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье 
					Или ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота 
					Или ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
					ОформлениеСтроки.Ячейки["НЧ"+НомерДня].ЦветФона = БледноКрасныйЦвет;
					ОформлениеСтроки.Ячейки["ВЧ"+НомерДня].ЦветФона = БледноКрасныйЦвет;
					ОформлениеСтроки.Ячейки["День"+НомерДня].ЦветФона = БледноКрасныйЦвет;
				Иначе
					ОформлениеСтроки.Ячейки["НЧ"+НомерДня].ЦветФона = Новый Цвет();	
					ОформлениеСтроки.Ячейки["ВЧ"+НомерДня].ЦветФона = Новый Цвет();	
					ОформлениеСтроки.Ячейки["День"+НомерДня].ЦветФона = Новый Цвет();	
				КонецЕсли;
			Иначе
				Если ДеньНеделиМесяца = 6 Или ДеньНеделиМесяца = 7 Тогда
					ОформлениеСтроки.Ячейки["НЧ"+НомерДня].ЦветФона = БледноКрасныйЦвет;
					ОформлениеСтроки.Ячейки["ВЧ"+НомерДня].ЦветФона = БледноКрасныйЦвет;
					ОформлениеСтроки.Ячейки["День"+НомерДня].ЦветФона = БледноКрасныйЦвет;
				Иначе
					ОформлениеСтроки.Ячейки["НЧ"+НомерДня].ЦветФона = Новый Цвет();	
					ОформлениеСтроки.Ячейки["ВЧ"+НомерДня].ЦветФона = Новый Цвет();	
					ОформлениеСтроки.Ячейки["День"+НомерДня].ЦветФона = Новый Цвет();	
				КонецЕсли;
			КонецЕсли;
			
			
			
		КонецЕсли;
		ДеньНеделиМесяца = (ДеньНеделиМесяца%7)+1;
	КонецЦикла;
	
	
	
	ОформлениеСтроки.Ячейки.ДнейЗаМесяц.УстановитьТекст(Строка(ИтогоДней));
	ОформлениеСтроки.Ячейки.ЧасовЗаМесяц.УстановитьТекст(Строка(ИтогоЧасов));
	ОформлениеСтроки.Ячейки.ВечернихЧасовЗаМесяц.УстановитьТекст(Строка(ИтогоВечерних));
	ОформлениеСтроки.Ячейки.НочныхЧасовЗаМесяц.УстановитьТекст(Строка(ИтогоНочных));
	
	//ЭлементыФормы.ТабличноеПолеГрафика.Колонки.Итого.ОтображатьВПодвале = Ложь;
	//ЭлементыФормы.ТабличноеПолеГрафика.Колонки.ИзНихВечерних.ОтображатьВШапке = Ложь;
	//ЭлементыФормы.ТабличноеПолеГрафика.Колонки.ИзНихНочных.ОтображатьВШапке = Ложь;
	//ЭлементыФормы.ТабличноеПолеГрафика.Колонки.ИзНихВечерних.ОтображатьВПодвале = Ложь;
	//ЭлементыФормы.ТабличноеПолеГрафика.Колонки.ИзНихНочных.ОтображатьВПодвале = Ложь;
	//ЭлементыФормы.ТабличноеПолеГрафика.ВысотаПодвала = 1;
	
КонецПроцедуры

Процедура ТабличноеПолеГрафикаПередНачаломДобавления(Элемент, Отказ, Копирование)
	Отказ = Истина;
КонецПроцедуры

Процедура ТабличноеПолеГрафикаПриПолученииДанных(Элемент, ОформленияСтрок)
	
	 	
	Если УчитыватьВечерниеЧасы ИЛИ УчитыватьНочныеЧасы Тогда
		Для Каждого ОформлениеСтроки Из ОформленияСтрок Цикл
			ОформлениеСтроки.Ячейки.ЧасовЗаДень.УстановитьТекст(НСтр("ru='Часов за день';uk='Годин за день'"));
			ОформлениеСтроки.Ячейки.ИзНихВечерних.УстановитьТекст(НСтр("ru='Из них вечерних';uk='З них вечірніх'"));
			ОформлениеСтроки.Ячейки.ИзНихНочных.УстановитьТекст(НСтр("ru='Из них ночных';uk='З них нічних'"));
		КонецЦикла;
	КонецЕсли;

	
	//НомерГода = Год(ТекущийГод);    Я
	//Для Каждого Оформление Из ОформленияСтрок Цикл
	//	Если Оформление.ДанныеСтроки
	//	НомерМесяца = Оформление.ДанныеСтроки.НомерМесяца;
	//	Для НомерДня = День(КонецМесяца(Дата(НомерГода, НомерМесяца, 1)))+1 По 31 Цикл
	//		Оформление.Ячейки["День"+НомерДня].Видимость = Ложь;
	//		Оформление.Ячейки["День"+НомерДня].ТолькоПросмотр = Ложь;
	//		Оформление.Ячейки["День"+НомерДня].ЦветФона = ЦветаСтиля.ФонНедоступнойСтрокиДокумента;
	//		Оформление.Ячейки["ВЧ"+НомерДня].Видимость = Ложь;
	//		Оформление.Ячейки["ВЧ"+НомерДня].ТолькоПросмотр = Ложь;
	//		Оформление.Ячейки["ВЧ"+НомерДня].ЦветФона = ЦветаСтиля.ФонНедоступнойСтрокиДокумента;
	//		Оформление.Ячейки["НЧ"+НомерДня].Видимость = Ложь;
	//		Оформление.Ячейки["НЧ"+НомерДня].ТолькоПросмотр = Ложь;
	//		Оформление.Ячейки["НЧ"+НомерДня].ЦветФона = ЦветаСтиля.ФонНедоступнойСтрокиДокумента;
	//		
	//	КонецЦикла;
	//КонецЦикла;
КонецПроцедуры

Процедура ТабличноеПолеГрафикаПередНачаломИзменения(Элемент, Отказ)
	Если День(КонецМесяца(Дата(НомерТекущегоГода, Элемент.ТекущаяСтрока.НомерМесяца, 1))) < Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(Элемент.ТекущаяКолонка.Имя, "День", ""), "ВЧ", ""), "НЧ", "")) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура НомерТекущегоГодаПриИзменении(Элемент)
	
	Если ДанныеКалендаряИзменены Тогда
		// запомним текущие данные в таблице для записи
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 1, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 2, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 3, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 4, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 5, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 6, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 7, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 8, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 9, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 10, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 11, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(Год(ТекущийГод), 12, 1), Истина);
		ПоместитьТаблицуВТаблицуДляЗаписи(КалендарьНаборЗаписей, ТаблицаДляЗаписи, НачалоГода(ТекущийГод), КонецГода(ТекущийГод));
		ДанныеКалендаряИзменены = Ложь;
	КонецЕсли; 
	
	ТекущийГод = НачалоГода(Дата(НомерТекущегоГода, 1, 1));
	
	
	Если ОтразитьГодВНабореЗаписей(ТекущийГод) = 0 тогда
		ОтразитьГодВНабореЗаписей(ТекущийГод, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru='Не заполнено наименование графика работы!';uk='Не заповнено найменування графіка роботи!'"));
	КонецЕсли;
	
	Если ДанныеКалендаряИзменены Тогда
		// запомним текущие данные в таблице для записи
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 1, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 2, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 3, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 4, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 5, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 6, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 7, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 8, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 9, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 10, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 11, 1), Истина);
		СоответствиеИнтервалыРедактирования.Вставить(Дата(НомерТекущегоГода, 12, 1), Истина);
		ПоместитьТаблицуВТаблицуДляЗаписи(КалендарьНаборЗаписей, ТаблицаДляЗаписи, НачалоГода(ТекущийГод), КонецГода(ТекущийГод));
		ДанныеКалендаряИзменены = Ложь;
	КонецЕсли; 

КонецПроцедуры

Процедура ТабличноеПолеГрафикаДеньПриИзменении(Элемент)
	ДанныеКалендаряИзменены = Истина;
	Модифицированность = Истина;
КонецПроцедуры

Процедура ТабличноеПолеГрафикаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

Процедура СсылкаИзменитьПараметрыЗаполненияНажатие(Элемент)
	
	ФормаЗаполнить = Справочники.ГрафикиРаботы.ПолучитьФорму("ФормаЗаполнить", ЭтаФорма);
	ФормаЗаполнить.ОткрыватьНастройки = Истина;
	ЗначениеВозврата = ФормаЗаполнить.ОткрытьМодально();
	
	Если ЗначениеВозврата = "Заполнить" Тогда
		НомерТекущегоГодаПриИзменении(ЭлементыФормы.НомерТекущегоГода);
		Отказ = Ложь;
		Если ПроверитьЗаполненностьГрафика(ТекущийГод)Тогда
			
			Вопрос = НСтр("ru='График на ';uk='Графік на '") + Формат(ЭлементыФормы.НомерТекущегоГода.Значение, "ЧГ=5") + НСтр("ru=' год уже заполнен. Вы хотите перезаполнить график?';uk=' рік вже заповнений. Ви хочете перезаповнити графік?'");
			Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ДаНетОтмена);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Отказ = Ложь;
			Иначе
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Не Отказ Тогда	
			ЗаписатьВФорме();
			ПоместитьТаблицуВТаблицуДляЗаписи(КалендарьНаборЗаписей, ТаблицаДляЗаписи, НачалоГода(ТекущийГод), КонецГода(ТекущийГод));
			ДатаНачалаИнтервала    	= НачалоГода(ТекущийГод);
			ДатаОкончанияИнтервала  = КонецГода(ТекущийГод);
			АвтозаполнениеКалендаря(ДатаНачалаИнтервала, ДатаОкончанияИнтервала);
			ДатаМесяца = ДатаНачалаИнтервала;
			Пока ДатаМесяца <= ДатаОкончанияИнтервала Цикл
				СоответствиеИнтервалыРедактирования.Вставить(ДатаМесяца, Истина);
				ДатаМесяца = ДобавитьМесяц(ДатаМесяца, 1);
			КонецЦикла;
			ОтразитьГодВНабореЗаписей(ДатаНачалаИнтервала);
			
			УстановитьДоступностьРеквизитов();
			
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	ОбновитьИнформационнуюСтроку();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ДлинаСуток = 86400;
ПерваяДата = НачалоДня(ОбщегоНазначения.ПолучитьРабочуюДату());
ПерваяДата = ПерваяДата - ДеньНедели(ПерваяДата) * ДлинаСуток;
ДниНедели = Новый Соответствие;
Для ДеньНедели = 1 По 7 Цикл
	ДниНедели.Вставить(ДеньНедели, НРег(Формат(ПерваяДата + ДеньНедели * ДлинаСуток,"ДФ=ддд")));
КонецЦикла;

БледноКрасныйЦвет = Новый Цвет(255, 235, 235);
